Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКорневойПапкиВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПапкиГЧВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПапкиКомпозицииВPDM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНаДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сметчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МатериалыПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияЭлемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЭлемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезАртикула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Проекты/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	КонтрольНаименованияПапки(Ссылка);  
	
	Если НЕ (ПометкаУдаления ИЛИ ПараметрыСеанса.ЗагрузкаИзБитрикс) И ЕстьДоговор Тогда
		омОбменБитрикс24.СинхронизацияСделокиСБитрикс(Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрольНаименованияПапки(текСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", текСсылка);
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиИзделия(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиПомещения(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиЭлементыСделки(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиДоговорСделки(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиКомплект(текСсылка));	
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиПроизводственныйКомплект(текСсылка));
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиГабаритныеЧертежи(текСсылка));
	ПроверкаПапки(Запрос,текСсылка,ДанныеДляКонтрольПапкиКомпозиции(текСсылка));
КонецПроцедуры // КонтрольНаименованияПапки()

&НаСервере
Процедура ПроверкаПапки(Запрос,текСсылка,стПараметры)
	
	Запрос.Текст = стПараметры.ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьПапка = Ложь;
	НаименованиеПапки = "";
	СсылкаНаПапку = Справочники[стПараметры.НаименованиеСправочника].ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		ЕстьПапка = Истина;
		НаименованиеПапки = Выборка.Наименование;
		СсылкаНаПапку = Выборка.СсылкаНаПапку;
	КонецЦикла;
	
	КонтрольПапки(ЕстьПапка,НаименованиеПапки,СсылкаНаПапку,текСсылка,стПараметры);
	
КонецПроцедуры // ПроверкаПапки()


&НаСервере
Функция ДанныеДляКонтрольПапкиКомпозиции(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Композиции.Наименование КАК Наименование,
	               |	Композиции.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.Композиции КАК Композиции
	               |ГДЕ
	               |	Композиции.Проект = &Проект
	               |	И Композиции.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"Композиции");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиГабаритныеЧертежи(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ГабаритныеЧертежи.Наименование КАК Наименование,
	               |	ГабаритныеЧертежи.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
	               |ГДЕ
	               |	ГабаритныеЧертежи.Проект = &Проект
	               |	И ГабаритныеЧертежи.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ГабаритныеЧертежи");
	
КонецФункции // КонтрольПапкиИзделия()


&НаСервере
Функция ДанныеДляКонтрольПапкиЭлементыСделки(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияЭлемент.Наименование КАК Наименование,
	               |	ИзделияЭлемент.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияЭлемент КАК ИзделияЭлемент
	               |ГДЕ
	               |	ИзделияЭлемент.Проект = &Проект
	               |	И ИзделияЭлемент.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияЭлемент");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиИзделия(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияЗаказчика.Наименование КАК Наименование,
	               |	ИзделияЗаказчика.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияЗаказчика КАК ИзделияЗаказчика
	               |ГДЕ
	               |	ИзделияЗаказчика.Проект = &Проект
	               |	И ИзделияЗаказчика.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияЗаказчика");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиКомплект(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИзделияКомплект.Наименование КАК Наименование,
	               |	ИзделияКомплект.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ИзделияКомплект КАК ИзделияКомплект
	               |ГДЕ
	               |	ИзделияКомплект.Проект = &Проект
	               |	И ИзделияКомплект.ЭтоГруппа = ИСТИНА
	               |	И ИзделияКомплект.Родитель = ЗНАЧЕНИЕ(Справочник.ИзделияКомплект.ПустаяСсылка)";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ИзделияКомплект");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиПроизводственныйКомплект(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроизводственныеКомплекты.Наименование КАК Наименование,
	               |	ПроизводственныеКомплекты.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ПроизводственныеКомплекты КАК ПроизводственныеКомплекты
	               |ГДЕ
	               |	ПроизводственныеКомплекты.Проект = &Проект
	               |	И ПроизводственныеКомплекты.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ПроизводственныеКомплекты");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиДоговорСделки(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПриложенияКДоговорам.Наименование КАК Наименование,
	               |	ПриложенияКДоговорам.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.ПриложенияКДоговорам КАК ПриложенияКДоговорам
	               |ГДЕ
	               |	ПриложенияКДоговорам.Проект = &Проект
	               |	И ПриложенияКДоговорам.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"ПриложенияКДоговорам");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Функция ДанныеДляКонтрольПапкиПомещения(текСсылка)
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Помещения.Наименование КАК Наименование,
	               |	Помещения.Ссылка КАК СсылкаНаПапку
	               |ИЗ
	               |	Справочник.Помещения КАК Помещения
	               |ГДЕ
	               |	Помещения.Проект = &Проект
	               |	И Помещения.ЭтоГруппа = ИСТИНА";
	
	Возврат Новый Структура("ТекстЗапроса,НаименованиеСправочника"
	,ТекстЗапроса
	,"Помещения");
	
КонецФункции // КонтрольПапкиИзделия()

&НаСервере
Процедура КонтрольПапки(ЕстьПапка,НаименованиеПапки,СсылкаНаПапку,текСсылка,стПараметры)
	
	ПравильноеНаименованиеПапки = Справочники[стПараметры.НаименованиеСправочника].ПолучитьИмяПапки(текСсылка);
	
	Если ЕстьПапка Тогда
		Если НЕ НаименованиеПапки = ПравильноеНаименованиеПапки Тогда
			обСсылкаНаПапку = СсылкаНаПапку.ПолучитьОбъект();
			обСсылкаНаПапку.Наименование = ПравильноеНаименованиеПапки;
			обСсылкаНаПапку.Записать();
		КонецЕсли;
	Иначе
		обСсылкаНаПапку = Справочники[стПараметры.НаименованиеСправочника].СоздатьГруппу();
		обСсылкаНаПапку.Наименование = ПравильноеНаименованиеПапки;
		обСсылкаНаПапку.Проект = текСсылка;
		обСсылкаНаПапку.Записать();
	КонецЕсли;	
КонецПроцедуры // КонтрольПапки(ЕстьПапка,НаименованиеПапки,текСсылка,стПараметры)
